// toString() -> 숫자를 문자로 변환하는 메소드
// 10진수 -> 2진수 / 16진수
let num = 10;
num.toString(); // "10"
num.toString(2); // "1010"

let num = 255;
num2.toString(16); // "ff"


//==========================================================


// 내장 객체 Math
Math.PI; // 3.121592653589793

//----------------------------------------------------------

// Math.ceil() : 올림 메서드
let num1 = 5.1;
let num2 = 5.7;

//----------------------------------------------------------

Math.ceil(num1); // 6
Math.ceil(num2); //6

//----------------------------------------------------------

// Math.floor() : 내림 메서드
Math.floor(num1); // 5
Math.floor(num2); // 5

//----------------------------------------------------------

// Math.round() : 반올림 메서드
Math.round(num1); // 5
Math.round(num2); // 6

// 요구사항 : 소수점 둘째자리까지 표현(소수점 셋째 자리에서 반올림) -> 30.12
let userRate = 30.1234;
Math.round(userRate * 100)/100 // 30.12

//----------------------------------------------------------

// toFixed() : 소수점 자릿수
// let userRate = 30.1234;

// 요구사항 : 소수점 둘째자리까지 표현(소수점 셋째 자리에서 반올림) -> 30.12
userRate.toFixed(2); // "30.12"
userRate.toFixed(0); // "30"
userRate.toFixed(6); // "30.12400"

